faronov/efr32mg1p-zigbee-sensor/app.c
  // Drop any stale press state captured before AF init was complete.
  // This avoids false "long press" on the first post-boot release edge.
  button_short_press_pending = false;
  button_long_press_pending = false;
  button_pressed = false;
  button_press_start_tick = 0;

#endif

#if APP_DEBUG_RESET_NETWORK
  app_debug_reset_network_state();
#endif
  emberAfCorePrintln("Zigbee BME280 Sensor Application");
  emberAfCorePrintln("Silicon Labs EFR32MG1P + Bosch BME280");
  emberAfCorePrintln("Press BTN0 to join network or trigger sensor reading");

  // Initialize LED events
  sl_zigbee_event_init(&led_blink_event, led_blink_event_handler);
  sl_zigbee_event_init(&led_off_event, led_off_event_handler);

  // Button handling uses emberAfTickCallback() to check flags - no events needed

  // Initialize optimized rejoin event (TEMPORARILY DISABLED - event queue issue)
  // sl_zigbee_event_init(&rejoin_retry_event, rejoin_retry_event_handler);

  // Initialize configuration from NVM
  app_config_init();
  if (!log_basic_identity()) {
    basic_identity_pending = true;
  }

#if APP_DEBUG_DIAG_ALWAYS
  app_flash_probe();
#endif

  // Initialize BME280 sensor
  if (!app_sensor_init()) {
    emberAfCorePrintln("ERROR: Sensor initialization failed!");
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Rapid blink on error
    for (int i = 0; i < 10; i++) {
      sl_led_toggle(&sl_led_led0);
      sl_sleeptimer_delay_millisecond(100);
    }
#endif
  }

  app_configure_default_reporting();

#if APP_DEBUG_AUTO_JOIN_ON_BOOT
  APP_DEBUG_PRINTF("Debug: auto-join on boot\n");
  handle_short_press();
#endif

#if APP_DEBUG_AUTO_JOIN_ON_PIN_RESET
  // TRADFRI button can be wired to reset line on some hardware revisions.
  // If boot reason is external pin reset, treat it as an implicit join request.
  if (halGetResetInfo() == 0x03u) {
    APP_DEBUG_PRINTF("Debug: auto-join after pin reset\n");
    handle_short_press();
  }
#endif
}

static void app_configure_default_reporting(void)
{
#ifdef SL_CATALOG_ZIGBEE_REPORTING_PRESENT
  EmberAfPluginReportingEntry entry;
  EmberAfStatus st;

  memset(&entry, 0, sizeof(entry));
  entry.direction = EMBER_ZCL_REPORTING_DIRECTION_REPORTED;
  entry.endpoint = 1;
  entry.mask = CLUSTER_MASK_SERVER;
  entry.manufacturerCode = EMBER_AF_NULL_MANUFACTURER_CODE;

  entry.clusterId = ZCL_TEMP_MEASUREMENT_CLUSTER_ID;
  entry.attributeId = ZCL_TEMP_MEASURED_VALUE_ATTRIBUTE_ID;
  entry.data.reported.minInterval = 10;
  entry.data.reported.maxInterval = 300;
  entry.data.reported.reportableChange = 50;   // 0.50 C (0.01C units)
  st = emberAfPluginReportingConfigureReportedAttribute(&entry);
  APP_DEBUG_PRINTF("Reporting default: temp -> 0x%02x\n", st);

  entry.clusterId = ZCL_RELATIVE_HUMIDITY_MEASUREMENT_CLUSTER_ID;
  entry.attributeId = ZCL_RELATIVE_HUMIDITY_MEASURED_VALUE_ATTRIBUTE_ID;
  entry.data.reported.minInterval = 10;
  entry.data.reported.maxInterval = 300;
  entry.data.reported.reportableChange = 100;  // 1.00 %RH (0.01% units)
  st = emberAfPluginReportingConfigureReportedAttribute(&entry);
  APP_DEBUG_PRINTF("Reporting default: humidity -> 0x%02x\n", st);

  entry.clusterId = ZCL_PRESSURE_MEASUREMENT_CLUSTER_ID;
  entry.attributeId = ZCL_PRESSURE_MEASURED_VALUE_ATTRIBUTE_ID;
  entry.data.reported.minInterval = 10;
  entry.data.reported.maxInterval = 300;
  entry.data.reported.reportableChange = 1;    // 1 kPa (cluster units)
  st = emberAfPluginReportingConfigureReportedAttribute(&entry);
  APP_DEBUG_PRINTF("Reporting default: pressure -> 0x%02x\n", st);

  entry.clusterId = ZCL_POWER_CONFIG_CLUSTER_ID;
  entry.attributeId = ZCL_BATTERY_VOLTAGE_ATTRIBUTE_ID;
  entry.data.reported.minInterval = 30;
  entry.data.reported.maxInterval = 1800;
  entry.data.reported.reportableChange = 1;    // 0.1V (100mV units)
  st = emberAfPluginReportingConfigureReportedAttribute(&entry);
  APP_DEBUG_PRINTF("Reporting default: battery voltage -> 0x%02x\n", st);

  entry.clusterId = ZCL_POWER_CONFIG_CLUSTER_ID;
  entry.attributeId = ZCL_BATTERY_PERCENTAGE_REMAINING_ATTRIBUTE_ID;
  entry.data.reported.minInterval = 30;
  entry.data.reported.maxInterval = 1800;
  entry.data.reported.reportableChange = 2;    // 1% (0.5% units)
  st = emberAfPluginReportingConfigureReportedAttribute(&entry);
  APP_DEBUG_PRINTF("Reporting default: battery pct -> 0x%02x\n", st);
#endif
}

void emberAfMainInitCallback(void)
{
  app_init_once();
}

#if APP_DEBUG_RESET_NETWORK
static void app_debug_reset_network_state(void)
{
  if (debug_reset_network_done) {
    return;
  }
  debug_reset_network_done = true;
  emberAfCorePrintln("Debug: resetting network state");
  EmberStatus leave_status = emberLeaveNetwork();
  emberAfCorePrintln("Debug: leave network -> 0x%02X", leave_status);
  EmberStatus bind_status = emberClearBindingTable();
  emberAfCorePrintln("Debug: clear binding table -> 0x%02X", bind_status);
  EmberStatus key_status = emberClearKeyTable();
  emberAfCorePrintln("Debug: clear key table -> 0x%02X", key_status);
  join_attempt_count = 0;
  current_channel_index = 0;
  join_scan_in_progress = false;
  join_network_found = false;
  network_join_in_progress = false;
}
#endif

void app_debug_force_af_init(void)
{
#if defined(APP_DEBUG_FORCE_AF_INIT) && (APP_DEBUG_FORCE_AF_INIT != 0)
  if (!af_init_seen) {
    APP_DEBUG_PRINTF("AF init requested (debug)\n");
    af_init_force_pending = true;
  }
#endif
}

void app_debug_poll(void)
{
  uint32_t now = sl_sleeptimer_get_tick_count();

  if (!af_init_reported && af_init_seen) {
    af_init_reported = true;
    APP_DEBUG_PRINTF("AF init seen (tick)\n");
  }

  if (af_init_force_pending && !af_init_seen) {
    if (af_init_force_tick == 0) {
      af_init_force_tick = now;
    } else if (sl_sleeptimer_tick_to_ms(now - af_init_force_tick) >= 2000) {
      APP_DEBUG_PRINTF("AF init timeout - fallback callback\n");
      app_init_once();
      af_init_force_pending = false;
    }
  }

#ifdef SL_CATALOG_SIMPLE_BUTTON_PRESENT
  // Keep simple_button state machine updated even if AF tick callback isn't
  // scheduled frequently on this target.
  sl_simple_button_poll_instances();
#endif

  // Some debug builds run without AF tick wiring, so process deferred joins here.
  if (join_pending && af_init_seen && !network_join_in_progress) {
    join_pending = false;
    APP_DEBUG_PRINTF("Join: deferred request starting (poll)\n");
    handle_short_press();
  }

  // Some targets do not run emberAfTickCallback reliably in this app flow.
  // Consume button flags here as well to guarantee action dispatch.
  if (button_short_press_pending) {
    button_short_press_pending = false;
    APP_DEBUG_PRINTF("Button short press\n");
    emberAfCorePrintln("Button: Short press detected (poll callback)");
    handle_short_press();
  }

  if (button_long_press_pending) {
    button_long_press_pending = false;
    APP_DEBUG_PRINTF("Button long press\n");
    emberAfCorePrintln("Button: Long press detected (poll callback)");
    handle_long_press();
  }

  if (basic_identity_pending && af_init_seen) {
    if (basic_identity_tick == 0 ||
        sl_sleeptimer_tick_to_ms(now - basic_identity_tick) >= 2000) {
      basic_identity_tick = now;
      if (log_basic_identity()) {
        basic_identity_pending = false;
      }
    }
  }

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT) && (APP_DEBUG_AWAKE_AFTER_JOIN_MS > 0)
  if (app_join_awake_active && app_join_awake_start_tick != 0) {
    uint32_t elapsed_ms = sl_sleeptimer_tick_to_ms(now - app_join_awake_start_tick);
    if (elapsed_ms >= APP_DEBUG_AWAKE_AFTER_JOIN_MS) {
      sl_power_manager_remove_em_requirement(SL_POWER_MANAGER_EM0);
      app_join_awake_active = false;
      app_join_awake_start_tick = 0;
      APP_DEBUG_PRINTF("Debug: post-join awake window ended\n");
    }
  }
#endif

