faronov/efr32mg1p-zigbee-sensor/app.c
static void app_flash_send_cmd(GPIO_Port_TypeDef port,
                               unsigned int pin,
                               uint8_t cmd)
{
  app_flash_enable_init();
  GPIO_PinModeSet(port, pin, gpioModePushPull, 1);
  uint8_t tx[1] = {cmd};
  GPIO_PinOutClear(port, pin);
  (void)SPIDRV_MTransmitB(sl_spidrv_exp_handle, tx, sizeof(tx));
  GPIO_PinOutSet(port, pin);
}

static bool app_flash_probe_with_cs(GPIO_Port_TypeDef port,
                                    unsigned int pin,
                                    const char *label)
{
  GPIO_PinModeSet(port, pin, gpioModePushPull, 1);

  app_flash_send_cmd(port, pin, 0xFF); // Release from continuous read (safe no-op)
  app_flash_send_cmd(port, pin, 0xAB); // Release from deep power-down
  app_flash_send_cmd(port, pin, 0x66); // Reset enable
  app_flash_send_cmd(port, pin, 0x99); // Reset memory
  sl_sleeptimer_delay_millisecond(1);

  uint8_t tx[4] = {0x9F, 0x00, 0x00, 0x00};
  uint8_t rx[4] = {0};

  GPIO_PinOutClear(port, pin);
  Ecode_t status = SPIDRV_MTransferB(sl_spidrv_exp_handle, tx, rx, sizeof(tx));
  GPIO_PinOutSet(port, pin);
  if (status != ECODE_OK) {
    APP_DEBUG_PRINTF("SPI flash: JEDEC read failed (%s, 0x%lx)\n",
                     label,
                     (unsigned long)status);
    return false;
  }

  APP_DEBUG_PRINTF("SPI flash: JEDEC ID %02X %02X %02X (%s)\n",
                   rx[1],
                   rx[2],
                   rx[3],
                   label);

  tx[0] = 0x05; // Read Status Register-1
  memset(rx, 0, sizeof(rx));
  GPIO_PinOutClear(port, pin);
  status = SPIDRV_MTransferB(sl_spidrv_exp_handle, tx, rx, 2);
  GPIO_PinOutSet(port, pin);
  if (status == ECODE_OK) {
    APP_DEBUG_PRINTF("SPI flash: SR1=0x%02X (%s)\n", rx[1], label);
  }

  tx[0] = 0x35; // Read Status Register-2
  memset(rx, 0, sizeof(rx));
  GPIO_PinOutClear(port, pin);
  status = SPIDRV_MTransferB(sl_spidrv_exp_handle, tx, rx, 2);
  GPIO_PinOutSet(port, pin);
  if (status == ECODE_OK) {
    APP_DEBUG_PRINTF("SPI flash: SR2=0x%02X (%s)\n", rx[1], label);
  }

  return !((rx[1] == 0x00 && rx[2] == 0x00 && rx[3] == 0x00)
           || (rx[1] == 0xFF && rx[2] == 0xFF && rx[3] == 0xFF));
}


/**
 * @brief Network join success callback
 *
 * Called when the device successfully joins a Zigbee network.
 */
void emberAfStackStatusCallback(EmberStatus status)
{
#if APP_DEBUG_SPI_ONLY
  (void)status;
  return;
#endif
  APP_DEBUG_PRINTF("Stack status: 0x%02x\n", status);
  if (status == EMBER_NETWORK_UP) {
    emberAfCorePrintln("Network joined successfully");
    EmberNodeType runtime_node_type = EMBER_UNKNOWN_DEVICE;
    if (emberGetNodeType(&runtime_node_type) == EMBER_SUCCESS) {
      APP_DEBUG_PRINTF("Join: runtime node type=%u\n", runtime_node_type);
    }

    // SED keep-alive policy per Ember 7.x SDK: allow MAC-data-poll keep alive,
    // while still supporting networks that use end-device-timeout keep alive.
    EmberStatus ka_status = emberSetKeepAliveMode(EMBER_KEEP_ALIVE_SUPPORT_ALL);
    APP_DEBUG_PRINTF("Join: set keep-alive mode(all) -> 0x%02x\n", ka_status);

#if (APP_DEBUG_MANUAL_POLL_BOOST_MS > 0)
    if (runtime_node_type == EMBER_SLEEPY_END_DEVICE) {
      app_manual_poll_boost_active = true;
      app_manual_poll_boost_start_tick = sl_sleeptimer_get_tick_count();
      app_manual_poll_boost_last_tick = 0;
      APP_DEBUG_PRINTF("Debug: manual poll boost enabled for %lu ms (interval=%lu ms)\n",
                       (unsigned long)APP_DEBUG_MANUAL_POLL_BOOST_MS,
                       (unsigned long)APP_DEBUG_MANUAL_POLL_INTERVAL_MS);
    } else {
      app_manual_poll_boost_active = false;
      app_manual_poll_boost_start_tick = 0;
      app_manual_poll_boost_last_tick = 0;
    }
#endif

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT) && (APP_DEBUG_AWAKE_AFTER_JOIN_MS > 0)
    if (!app_join_awake_active) {
      sl_power_manager_add_em_requirement(SL_POWER_MANAGER_EM0);
      app_join_awake_active = true;
      app_join_awake_start_tick = sl_sleeptimer_get_tick_count();
      APP_DEBUG_PRINTF("Debug: keeping EM0 for %lu ms after join\n",
                       (unsigned long)APP_DEBUG_AWAKE_AFTER_JOIN_MS);
    }
#endif

#if (APP_DEBUG_FAST_POLL_AFTER_JOIN_MS > 0)
    emberAfSetDefaultPollControlCallback(EMBER_AF_SHORT_POLL);
    emberAfAddToCurrentAppTasksCallback(EMBER_AF_FORCE_SHORT_POLL);
    emberAfAddToCurrentAppTasksCallback(EMBER_AF_FORCE_SHORT_POLL_FOR_PARENT_CONNECTIVITY);
    emberAfSetShortPollIntervalMsCallback((int16u)APP_DEBUG_FAST_POLL_INTERVAL_MS);
    emberAfSetWakeTimeoutMsCallback((int16u)APP_DEBUG_FAST_POLL_AFTER_JOIN_MS);
    emberAfSetDefaultSleepControl(EMBER_AF_STAY_AWAKE);
    app_fast_poll_active = true;
    app_fast_poll_start_tick = sl_sleeptimer_get_tick_count();
    APP_DEBUG_PRINTF("Debug: fast poll enabled for %lu ms (short=%lu ms)\n",
                     (unsigned long)APP_DEBUG_FAST_POLL_AFTER_JOIN_MS,
                     (unsigned long)APP_DEBUG_FAST_POLL_INTERVAL_MS);
#endif

    // Reset join attempt counter and scan state on success
    join_attempt_count = 0;
    current_channel_index = 0;
    network_join_in_progress = false;
    join_scan_in_progress = false;
    join_network_found = false;

    // Cancel any pending rejoin attempts - network is up (TEMPORARILY DISABLED)
    // rejoin_state = REJOIN_STATE_DONE;
    // sl_zigbee_event_set_inactive(&rejoin_retry_event);

    // Stop LED blinking
    led_blink_active = false;
    sl_zigbee_event_set_inactive(&led_blink_event);

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Turn LED on solid to indicate network is up
    sl_led_turn_on(&sl_led_led0);

    // Schedule LED to turn off after 3 seconds to save power
    sl_zigbee_event_set_delay_ms(&led_off_event, 3000);
#endif

    // Avoid heavy sensor transactions right at join/interview start.
    // Start periodic updates and let first sample happen on timer.
    app_sensor_start_periodic_updates();

    // Note: Binding is handled by coordinator (Zigbee2MQTT/ZHA/deCONZ)
    // No device-side binding code needed - see BINDING_GUIDE.md

  } else if (status == EMBER_NETWORK_DOWN) {
    emberAfCorePrintln("Network down - will attempt optimized rejoin");

