faronov/efr32mg1p-zigbee-sensor/app.c
#if (APP_DEBUG_FAST_POLL_AFTER_JOIN_MS > 0)
    emberAfSetDefaultPollControlCallback(EMBER_AF_LONG_POLL);
    emberAfRemoveFromCurrentAppTasksCallback(EMBER_AF_FORCE_SHORT_POLL);
    emberAfRemoveFromCurrentAppTasksCallback(EMBER_AF_FORCE_SHORT_POLL_FOR_PARENT_CONNECTIVITY);
    emberAfSetDefaultSleepControl(EMBER_AF_OK_TO_SLEEP);
    app_fast_poll_active = false;
    app_fast_poll_start_tick = 0;
#endif

    app_manual_poll_boost_active = false;
    app_manual_poll_boost_start_tick = 0;
    app_manual_poll_boost_last_tick = 0;

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Turn LED off when network is down
    sl_led_turn_off(&sl_led_led0);
    // Cancel any pending LED off event
    sl_zigbee_event_set_inactive(&led_off_event);
#endif

    // Stop periodic sensor timer while network is down to avoid 10s wakeups.
    app_sensor_stop_periodic_updates();

    // Optimized rejoin TEMPORARILY DISABLED - event queue issue
    // emberAfCorePrintln("Scheduling optimized rejoin in 100ms...");
    // rejoin_state = REJOIN_STATE_IDLE;
    // sl_zigbee_event_set_delay_ms(&rejoin_retry_event, 100);

  }
}

void emberAfPluginEndDeviceSupportPollCompletedCallback(EmberStatus status)
{
  // Avoid log spam on normal idle polls.
  if (status != EMBER_MAC_NO_DATA) {
    APP_DEBUG_PRINTF("Poll complete: status=0x%02x\n", status);
  }
}

bool emberAfPreCommandReceivedCallback(EmberAfClusterCommand *cmd)
{
  if (cmd != NULL && cmd->mfgSpecific == 0u) {
    if (cmd->commandId == ZCL_CONFIGURE_REPORTING_COMMAND_ID
        || cmd->commandId == ZCL_READ_REPORTING_CONFIGURATION_COMMAND_ID) {
      APP_DEBUG_PRINTF("ZCL cfg-report rx: ep=%u clus=0x%04x cmd=0x%02x dir=%u len=%u\n",
                       cmd->apsFrame->destinationEndpoint,
                       cmd->apsFrame->clusterId,
                       cmd->commandId,
                       (unsigned)((cmd->buffer[0] & ZCL_FRAME_CONTROL_CLIENT_TO_SERVER) ? 1 : 0),
                       cmd->bufLen);
    }
  }
  return false;
}

/**
 * @brief Button press callback
 *
 * Called when a button is pressed or released on the board.
 * Detects short press (<5s) vs long press (>=5s).
 *
 * CRITICAL: This runs in ISR context (GPIO_ODD_IRQn)!
 * CANNOT call ANY functions that interact with Zigbee stack!
 * CANNOT call emberAfCorePrintln()!
 * CANNOT call sl_zigbee_event_set_active()!
 *
 * Only allowed: read hardware, do math, set volatile flags
 * The button_poll_event running in main context will check these flags
 */
#ifdef SL_CATALOG_SIMPLE_BUTTON_PRESENT
void sl_button_on_change(const sl_button_t *handle)
{
  if (handle == &sl_button_btn0) {
    // Ignore button edges before AF init to avoid stale hold-duration math.
    if (!af_init_seen) {
      button_pressed = false;
      button_press_start_tick = 0;
      return;
    }

    if (sl_button_get_state(handle) == SL_SIMPLE_BUTTON_PRESSED) {
      // Button pressed - record start time
      button_press_start_tick = sl_sleeptimer_get_tick_count();
      button_pressed = true;
      APP_DEBUG_PRINTF("BTN0: PRESSED\n");
    } else {
      // Button released - check duration
      if (button_pressed) {
        uint32_t duration_ticks = sl_sleeptimer_get_tick_count() - button_press_start_tick;
        uint32_t duration_ms = sl_sleeptimer_tick_to_ms(duration_ticks);
        APP_DEBUG_PRINTF("BTN0: RELEASED\n");

        // Set flags for main context to poll
        // These will be checked by button_poll_event_handler()
        if (duration_ms >= BUTTON_DEBOUNCE_MS) {
          if (duration_ms >= LONG_PRESS_THRESHOLD_MS) {
            button_long_press_pending = true;
          } else {
            button_short_press_pending = true;
          }
        }

        button_pressed = false;
      }
    }
  }
}
#endif

/**
 * @brief LED blink event handler
 *
 * Blinks the LED while joining network.
 */
static void led_blink_event_handler(sl_zigbee_event_t *event)
{
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
  if (led_blink_active) {
    sl_led_toggle(&sl_led_led0);
    // Blink every 500ms
    sl_zigbee_event_set_delay_ms(&led_blink_event, 500);
  }
#endif
}

/**
 * @brief LED off event handler
 *
 * Turns off the LED after network join confirmation to save power.
 */
static void led_off_event_handler(sl_zigbee_event_t *event)
{
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
  sl_led_turn_off(&sl_led_led0);
  emberAfCorePrintln("LED turned off to save power");
#endif
}

/**
 * @brief Main tick callback - runs every main loop iteration
 *
 * This is called from main context and is perfect for checking button flags
 * set by the button ISR. No event scheduling needed!
 */
void emberAfTickCallback(void)
{
  static uint32_t last_heartbeat_tick = 0;
  uint32_t now = sl_sleeptimer_get_tick_count();

  app_debug_poll();

#if APP_DEBUG_SPI_ONLY
  if (button_short_press_pending) {
    button_short_press_pending = false;
    APP_DEBUG_PRINTF("Button short press\n");
    app_flash_probe();
  }

  if (button_long_press_pending) {
    button_long_press_pending = false;
    APP_DEBUG_PRINTF("Button long press\n");
    app_flash_probe();
  }
  return;
#endif

  if (join_pending && af_init_seen && !network_join_in_progress) {
    join_pending = false;
    APP_DEBUG_PRINTF("Join: deferred request starting\n");
    handle_short_press();
  }

  if (last_heartbeat_tick == 0 ||
      sl_sleeptimer_tick_to_ms(now - last_heartbeat_tick) >= 5000) {
    last_heartbeat_tick = now;
    APP_DEBUG_PRINTF("Heartbeat: net=%d join_in_progress=%d\n",
                     emberAfNetworkState(),
                     network_join_in_progress);
    if (APP_DEBUG_DIAG_ALWAYS) {
      EmberNetworkStatus state = emberAfNetworkState();
      APP_DEBUG_PRINTF("Zigbee state=%d, joined=%d\n",
                       state,
                       (state == EMBER_JOINED_NETWORK));
    }
  }

  // Check for short press
  if (button_short_press_pending) {
    button_short_press_pending = false;  // Clear flag
    APP_DEBUG_PRINTF("Button short press\n");
    emberAfCorePrintln("Button: Short press detected (tick callback)");
    handle_short_press();
  }

